Delans-TLE/src/Enums/ES_СтатусыЗаказов/ES_СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_СтатусыЗаказов</name>
  <enumValues>
    <name>ТребуетсяЗабор</name>
  </enumValues>
  <enumValues>
    <name>Комплектуется</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетГруз</name>
  </enumValues>
  <enumValues>
    <name>Назначен</name>
    <comment>Заказ в проведенном плане доставки</comment>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
    <comment>Заказ принят к исполнению</comment>
  </enumValues>
  <enumValues>
    <name>НеДоставлен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноДоставленРассчитать</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноДоставлен</name>
  </enumValues>
  <enumValues>
    <name>ДоставленВозвращен</name>
  </enumValues>
  <enumValues>
    <name>ДоставленРассчитать</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетВыдачи</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Принят</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенРассчитать</name>
  </enumValues>
  <enumValues>
    <name>НазначенПринят</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленПринят</name>
  </enumValues>
  <enumValues>
    <name>Некондиция</name>
  </enumValues>
  <enumValues>
    <name>БезСтатуса</name>
  </enumValues>
  <enumValues>
    <name>МеждуСкладами</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетГрузНазначен</name>
  </enumValues>
  <enumValues>
    <name>ОтмененПринят</name>
  </enumValues>
  <enumValues>
    <name>НеправильныйАдрес</name>
  </enumValues>
  <enumValues>
    <name>ПолучательПереехал</name>
  </enumValues>
  <enumValues>
    <name>ОфисПолучателяЗакрыт</name>
  </enumValues>
  <enumValues>
    <name>ПолучателяНетДомаВОфисе</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/CommonForms/ES_ФормаПодбора2/Module.bsl
&НаКлиенте
Перем мВыбраныСсылки;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Статус для установки параметром запроса	
	МассивСтатусов = Новый Массив;
	Если Параметры.ВидПодбора = "Платежи" Тогда
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ДоставленРассчитать);
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставленРассчитать);
	ИначеЕсли Параметры.ВидПодбора = "Заказы" Тогда
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.Отменен);
		МассивСтатусов.Добавить(Перечисления.ES_СтатусыЗаказов.ЧастичноДоставлен);
	КонецЕсли;
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("СтатусыЗаказов", МассивСтатусов);
	
	КонтрагентОтбора = Параметры.Контрагент;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	мВыбраныСсылки = Новый Массив;
	КоличествоВыбранныхЗаказов = 0;
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(мВыбраныСсылки);
	
КонецПроцедуры

// НЕ ИСПОЛЬЗУЕТСЯ
&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	//мВыбраныСсылки = Новый Массив;
	//Для каждого Стр Из Элементы.СписокЗаказов.ВыделенныеСтроки Цикл
	//	мВыбраныСсылки.Добавить(Стр.Заказ);
	//КонецЦикла; 
	//КоличествоВыбранныхЗаказов = мВыбраныСсылки.Количество();
	//
	//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	//Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры

// НЕ ИСПОЛЬЗУЕТСЯ
&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	//мВыбраныСсылки = Новый Массив;
	//КоличествоВыбранныхЗаказов = 0;
	//
	//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	//Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ ЗАКАЗЫ

&НаКлиенте
Процедура СписокЗаказовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаНаЗаказ = Элемент.ТекущиеДанные.Заказ;
	
	мИндекс = мВыбраныСсылки.Найти(СсылкаНаЗаказ);
	Если мИндекс = Неопределено Тогда
		мВыбраныСсылки.Добавить(СсылкаНаЗаказ);
	Иначе
		мВыбраныСсылки.Удалить(мИндекс);
	КонецЕсли; 
	КоличествоВыбранныхЗаказов = мВыбраныСсылки.Количество();
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("мВыбранныеСсылки", мВыбраныСсылки);
	Элементы.СписокЗаказов.Обновить();
	
КонецПроцедуры
